dataset_gen/NS_datasets/LDC/Irregular/Design_Point_0/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);  // Initial velocity everywhere is zero

boundaryField
{
    movingWall
    {
        type fixedValue;
        value           uniform (0.003784494757786056 0 0);
    }

    fixedWalls
    {
        type noSlip;  // Velocity remains (0,0,0) on these walls
    }

    holeWalls
    {
        type noSlip;  // No velocity inside the hole
    }

    frontAndBack
    {
        type empty;  // 2D simulation, no flow in z-direction
    }
}
